src/Documents/УслугиСобственнымПодразделениям/УслугиСобственнымПодразделениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УслугиСобственнымПодразделениям</name>
  <registerRecords>AccumulationRegister.КорректировкиНезавершенноеПроизводствоНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.КорректировкиСтроительствоОбъектовОсновныхСредствНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.УчетЗатрат</registerRecords>
  <registerRecords>AccumulationRegister.КорректировкиБракВПроизводствеНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.КорректировкиЗатратыНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.КорректировкиПартииТоваровНалоговыйУчет</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.ДокументыТребующиеДопроведения</registerRecords>
  <registerRecords>AccumulationRegister.УчетЗатратРегл</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаСтроительствоОбъектовОсновныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.СтроительствоОбъектовОсновныхСредств</registerRecords>
  <registerRecords>AccountingRegister.Налоговый</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВУправленческомУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВБухгалтерскомУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.ВидыРаспределенияПоПроектам</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НалоговоеНазначение</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬОтражатьВНалоговомУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Затраты</name>
    <attributes>
      <name>ПодразделениеПолучатель</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизацииПолучатель</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатурнаяГруппа</name>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Счет</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияПродукции</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаПродукции</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
        <types>CatalogRef.ВидыРаспределенияПоПроектам</types>
      </type>
    </attributes>
    <attributes>
      <name>НалоговоеНазначениеДоходовИЗатрат</name>
      <type>
        <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/УслугиСобственнымПодразделениям/ManagerModule.bsl
// Функция формирования печатной формы документа "УслугиСобственнымПодразделениям"
//
Функция ПечатьУслугиСобственнымПодразделениям(МассивОбъектов, ОбъектыПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УслугиСобственнымПодразделениям_УслугиСобственнымПодразделениям";
	
	Макет  = ПолучитьМакет("УслугиСобственнымПодразделениям");
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	УслугиСобственнымПодразделениям.Ссылка,
	|	УслугиСобственнымПодразделениям.Представление,
	|	УслугиСобственнымПодразделениям.Организация,
	|	УслугиСобственнымПодразделениям.Организация.Представление КАК ПечОрганизация,
	|	УслугиСобственнымПодразделениям.Номенклатура.Представление КАК ПечУслуга,
	|	ВЫБОР
	|		КОГДА &ТипУчета = ""Упр""
	|			ТОГДА УслугиСобственнымПодразделениям.Подразделение
	|		ИНАЧЕ УслугиСобственнымПодразделениям.ПодразделениеОрганизации
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА &ТипУчета = ""Упр""
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(УслугиСобственнымПодразделениям.Подразделение)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(УслугиСобственнымПодразделениям.ПодразделениеОрганизации)
	|	КОНЕЦ КАК ПечПодразделение,
	|	УслугиСобственнымПодразделениям.НоменклатурнаяГруппа КАК НомГруппа,
	|	ПРЕДСТАВЛЕНИЕ(УслугиСобственнымПодразделениям.НоменклатурнаяГруппа) КАК ПечНомГруппа,
	|	ПРЕДСТАВЛЕНИЕ(УслугиСобственнымПодразделениям.Номенклатура.БазоваяЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	|	УслугиСобственнымПодразделениям.Затраты.(
	|		НомерСтроки КАК НомерСтроки,
	|		ВЫБОР
	|			КОГДА &ТипУчета = ""Упр""
	|				ТОГДА УслугиСобственнымПодразделениям.Затраты.ПодразделениеПолучатель
	|			ИНАЧЕ УслугиСобственнымПодразделениям.Затраты.ПодразделениеОрганизацииПолучатель
	|		КОНЕЦ КАК ПодразделениеПолучатель,
	|		ВЫБОР
	|			КОГДА &ТипУчета = ""Упр""
	|				ТОГДА ПРЕДСТАВЛЕНИЕ(УслугиСобственнымПодразделениям.Затраты.ПодразделениеПолучатель)
	|			ИНАЧЕ ПРЕДСТАВЛЕНИЕ(УслугиСобственнымПодразделениям.Затраты.ПодразделениеОрганизацииПолучатель)
	|		КОНЕЦ КАК ПечПодразделениеПолучатель,
	|		Количество КАК ПечКоличество
	|	)
	|ИЗ
	|	Документ.УслугиСобственнымПодразделениям КАК УслугиСобственнымПодразделениям
	|ГДЕ
	|	УслугиСобственнымПодразделениям.Ссылка = &ТекДок
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ПервыйДокумент = Истина;
	
	Для Каждого Ссылка Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
	
		ТипУчета = ?(Ссылка.ОтражатьВУправленческомУчете, "Упр","Бух");
		Запрос.УстановитьПараметр("ТекДок",   Ссылка);
		Запрос.УстановитьПараметр("ТипУчета", ТипУчета);
	
		РезультатЗапроса = Запрос.Выполнить();
		Шапка = РезультатЗапроса.Выбрать();
		Шапка.Следующий();
		
		// Вывод заголовка
		Область = Макет.ПолучитьОбласть("Заголовок");
		Область.Параметры.Заполнить(Шапка);
		Область.Параметры.Заголовок 				= ОбщегоНазначения.СформироватьЗаголовокДокумента(Ссылка.ПолучитьОбъект());
		ТабДок.Вывести(Область);
		
		Область 		= Макет.ПолучитьОбласть("Шапка");
		ТабДок.Вывести(Область);
		Область 		= Макет.ПолучитьОбласть("Строка");
		ТабЧасть 		= Шапка.Затраты.Выбрать();
		КоличествоИтого = 0;
		
		Пока ТабЧасть.Следующий() Цикл
			
			Область.Параметры.Заполнить(ТабЧасть);
			Область.Параметры.ПечНомер = ТабЧасть.НомерСтроки;
			
			ТабДок.Вывести(Область);
			КоличествоИтого = КоличествоИтого + ТабЧасть.ПечКоличество;
			
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("Подвал");
		Область.Параметры.ПечКоличество    = КоличествоИтого;
		Область.Параметры.ЕдиницаИзмерения = ?(ЗначениеЗаполнено(Шапка.ЕдиницаИзмерения),", "+Шапка.ЕдиницаИзмерения,"");
		ТабДок.Вывести(Область);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, НомерСтрокиНачало, ОбъектыПечати, Ссылка);
		
	КонецЦикла; 
	
	Возврат ТабДок;
	
КонецФункции // ПечатьУслугиСобственнымПодразделениям()
	
// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОшибкиПечати          - Список значений  - Ошибки печати  (значение - ссылка на объект, представление - текст ошибки)
//   ОбъектыПечати         - Список значений  - Объекты печати (значение - ссылка на объект, представление - имя области в которой был выведен объект)
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УслугиСобственнымПодразделениям") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "УслугиСобственнымПодразделениям", "Услуги собственным подразделениям", ПечатьУслугиСобственнымПодразделениям(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры

// В функции описано, какие данные следует сохранять в шаблоне
Функция СтруктураДополнительныхДанныхФормы() Экспорт
	
	Возврат ХранилищаНастроек.ДанныеФорм.СформироватьСтруктуруДополнительныхДанных("Затраты");
	
КонецФункции
